jmeter/report/statistics.json
{
  "DELETE /todos/1" : {
    "transaction" : "DELETE /todos/1",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.0,
    "medianResTime" : 6.0,
    "minResTime" : 6.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.0,
    "throughput" : 166.66666666666666,
    "receivedKBytesPerSec" : 25.553385416666668,
    "sentKBytesPerSec" : 34.66796875
  },
  "PUT /todos/1" : {
    "transaction" : "PUT /todos/1",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11.0,
    "medianResTime" : 11.0,
    "minResTime" : 11.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 11.0,
    "throughput" : 90.9090909090909,
    "receivedKBytesPerSec" : 20.59659090909091,
    "sentKBytesPerSec" : 26.3671875
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 37.0,
    "medianResTime" : 18.0,
    "minResTime" : 6.0,
    "maxResTime" : 106.0,
    "pct1ResTime" : 106.0,
    "pct2ResTime" : 106.0,
    "pct3ResTime" : 106.0,
    "throughput" : 24.242424242424242,
    "receivedKBytesPerSec" : 10.925662878787879,
    "sentKBytesPerSec" : 5.516098484848484
  },
  "POST /todos" : {
    "transaction" : "POST /todos",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.0,
    "medianResTime" : 25.0,
    "minResTime" : 25.0,
    "maxResTime" : 25.0,
    "pct1ResTime" : 25.0,
    "pct2ResTime" : 25.0,
    "pct3ResTime" : 25.0,
    "throughput" : 40.0,
    "receivedKBytesPerSec" : 9.1015625,
    "sentKBytesPerSec" : 11.6015625
  },
  "GET /todos" : {
    "transaction" : "GET /todos",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 106.0,
    "medianResTime" : 106.0,
    "minResTime" : 106.0,
    "maxResTime" : 106.0,
    "pct1ResTime" : 106.0,
    "pct2ResTime" : 106.0,
    "pct3ResTime" : 106.0,
    "throughput" : 9.433962264150942,
    "receivedKBytesPerSec" : 11.276533018867925,
    "sentKBytesPerSec" : 1.1516067216981132
  }
}